package task;

public class Lambda {

    // TODO: Задача-1: Написать функциональный интерфейс с методом, который принимает число и
    //  возвращает булево значение. Написать реализацию такого интерфейса в виде
    //  лямбда-выражения с использованием ссылки на метод (method referent),
    //  которое возвращает true если переданное число делится без остатка на 13.

    static ShareDozen shareDozen = ShareDozen::isDozen;

    // TODO: Задача-2: Написать функциональный интерфейс с методом, который принимает две строки и
    //  возвращает строку. Написать реализацию такого интерфейса в виде лямбды с использованием ссылки на метод (method referent),
    //  которая возвращает ту строку, которая длиннее. Если строки равны, возвращать первую.

    static StringLonger stringLonger = StringLonger::getLonger;

    // TODO: Задача-3: Написать функциональный интерфейс с методом, который принимает три дробных
    //  числа: a, b, c и возвращает тоже дробное число. Написать реализацию такого
    //  интерфейса в виде лямбда-выражения, которое возвращает дискриминант. Кто забыл, D = b^2 — 4ac.

    static Calculate discriminant = Calculate::calcDiscriminant;

    // TODO: Задача-4: Используя функциональный интерфейс из задачи 5 написать лямбда-выражение,
    //  которое возвращает результат операции a * b^c.

    static Calculate function = Calculate::calcFunction;

    public static void main(String[] args) {

        // TODO: разработайте данный функционал используя лямбда выражения и ссылки на метод
        // FIXME: Подсказка: раскомментируй и сделай чтобы работало...
        System.out.println("Задача-1: " + shareDozen.isSharedDozen(26));
        System.out.println("Задача-2: " + stringLonger.getStringLonger("Люблю программировать", "на Java!"));
        System.out.println("Задача-3: " + discriminant.getCalc(3, 5, 7));
        System.out.println("Задача-4: " + function.getCalc(3, 5, 7));


        // TODO: пример вывода в консоль:
        //  Задача-1: true
        //  Задача-2: Люблю программировать
        //  Задача-3: -59.0
        //  Задача-4: 78128.0
    }
}
